#                                  Students Database(MongoDB)

In [14]:
import json
import pandas as pd
from pymongo import MongoClient

In [15]:
client = MongoClient("mongodb+srv://kishore:sharmila22@cluster0.5cp5uv7.mongodb.net/?retryWrites=true&w=majority")

In [16]:
mydb = client['students_database']
mycol = mydb['data']

In [17]:
file = open('students.json')
students_data = [json.loads(json_data) for json_data in file]

#### Warning data is already loaded in the database running  this cell again may cause Duplicate key Error

In [18]:
#inserting students data in to the collections(data) which is inside the database(students_database)
loading_data = [mycol.insert_one(student) for student in students_data]

In [19]:
# creating pandas DF and fetching the data 
data_A = mycol.find({})
data_B = {'ID':[],"name":[],"exam":[],'quiz':[],'homework':[]}
students_dataframe = pd.DataFrame(data_B)
for fetch in data_A:
    data_B['ID'].append(fetch['_id'])
    data_B['name'].append(fetch['name'])
    Scores = [marks['score'] for marks in fetch['scores']]
    data_B['exam'].append( Scores[0])
    data_B['quiz'].append( Scores[1])
    data_B['homework'].append( Scores[2])
students_dataframe = pd.DataFrame(data_B)
students_dataframe.head()

   ID              name       exam       quiz   homework
0   0        aimee Zank   1.463180  11.782733  35.874035
1   1  Aurelia Menendez  60.060451  52.797907  71.761334
2   2       Corliss Zuk  67.030771   6.301852  66.283447
3   3        Bao Ziglar  71.643439  24.802213  42.261471
4   4  Zachary Langlais  78.683851  90.296310  34.416201

####    1. Find the student name who scored maximum scores in all (exam, quiz and homework)?

In [20]:
students_dataframe['total'] = students_dataframe['exam'] + students_dataframe['quiz'] + students_dataframe['homework'] 
topper_total = students_dataframe['total'].max()
topper = students_dataframe[students_dataframe['total'] == topper_total]
topper

    ID              name     exam      quiz   homework       total
13  13  Jessika Dagenais  90.4718  90.30014  95.177538  275.949478

####  2.Find students who scored below average in the exam and pass mark is 40%?

In [21]:
average_mark = students_dataframe['exam'].mean()
average_mark

48.673670759501775

In [22]:
underperforming = students_dataframe.loc[(students_dataframe['exam'] < average_mark )& (students_dataframe['exam']>= 40),['ID','name','exam']]
underperforming

      ID              name       exam
5      5    Wilburn Spiess  44.871863
10    10      Denisha Cast  45.618769
19    19      Gisela Levin  44.512111
20    20    Tressa Schwing  42.174398
21    21      Rosana Vales  46.228948
23    23  Tamika Schildgen  45.654328
29    29   Gwyneth Garling  48.366450
42    42      Kayce Kenyon  44.624417
45    45    Terica Brugger  42.101131
57    57         Chad Rahe  40.845720
68    68   Jenise Mcguffie  40.152105
89    89        Cassi Heal  43.043110
100  100  Demarcus Audette  47.426086
109  109       Flora Duell  40.682390
126  126    Quincy Danaher  40.531369
128  128     Alix Sherrill  43.674362
142  142  Laureen Salomone  42.543230
143  143   Gwyneth Garling  44.295535
155  155     Aleida Elsass  42.895583
164  164      Alica Pasley  41.385282
167  167     Malisa Jeanes  40.686760
184  184  Harriett Velarde  41.479883
193  193    Mariela Sherer  47.671967

#### 3.Find students who scored below pass mark and assigned them as fail, and above pass mark as pass in all the categories

In [23]:
passed_students = students_dataframe.loc[(students_dataframe['exam'] >= 40) & (students_dataframe['quiz'] > 40) & (students_dataframe['homework'] >= 40),['ID','name','exam','quiz','homework']]
passed_students

      ID               name       exam       quiz   homework
1      1   Aurelia Menendez  60.060451  52.797907  71.761334
7      7       Salena Olmos  90.378265  42.487807  96.529862
10    10       Denisha Cast  45.618769  98.357232  55.908357
11    11       Marcus Blohm  78.426178  82.583728  87.499247
12    12     Quincy Danaher  54.298413  85.612702  80.407324
13    13   Jessika Dagenais  90.471800  90.300140  95.177538
18    18   Verdell Sowinski  62.128702  84.745862  81.589478
20    20     Tressa Schwing  42.174398  71.993148  81.239726
23    23   Tamika Schildgen  45.654328  64.329270  83.539334
32    32         Gwen Honig  87.143454  99.458244  76.664605
36    36   Eugene Magdaleno  73.055900  79.856216  66.091437
52    52       Tawana Oberg  80.590061  93.284381  93.121340
54    54        Joel Rueter  87.536369  92.709747  61.790326
55    55        Tresa Sinha  94.931370  72.322261  77.248769
61    61        Grady Zemke  51.915613  50.083494  95.341393
64    64      Whitley Fears  89.618458  82.448792  96.579121
65    65        Gena Riccio  67.583953  67.241350  42.934718
67    67       Merissa Mann  75.194973  52.565226  94.675182
68    68    Jenise Mcguffie  40.152105  90.602200  51.587203
75    75       Tonia Surace  80.936551  79.546202  41.343087
79    79     Mariela Sherer  61.201581  52.756573  90.970048
84    84     Timothy Harrod  93.230200  49.060103  74.007887
85    85         Rae Kohout  63.868943  55.815495  59.135660
90    90       Osvaldo Hirt  67.449315  41.779865  76.308795
97    97     Maren Scheider  94.432912  77.282637  59.463262
98    98        Carli Ector  88.180403  60.311109  96.336121
99    99      Jaclyn Morado  70.276271  56.784704  47.485183
102  102   Mercedez Garduno  49.528770  44.555051  81.508697
104  104    Brittny Warwick  69.543999  82.004699  95.964461
105  105     Shin Allbright  62.283889  85.268638  88.994794
108  108  Mikaela Meidinger  63.755951  59.522981  88.664814
109  109        Flora Duell  40.682390  46.779720  69.294001
110  110      Nobuko Linzey  67.407926  58.583311  47.448316
111  111      Gennie Ratner  62.743100  92.180138  53.111745
116  116        Corliss Zuk  76.454688  53.026429  91.865731
118  118   Zachary Langlais  62.204578  61.037334  82.416882
119  119     Wilburn Spiess  52.369630  96.571545  61.350340
126  126     Quincy Danaher  40.531369  83.092702  79.004551
127  127   Jessika Dagenais  96.934599  95.675637  70.788730
129  129     Tambra Mercure  62.614239  47.647767  85.205785
130  130      Dodie Staller  52.160511  83.515631  63.888576
141  141       Edgar Sarkis  65.998880  58.755989  75.063794
159  159     Terica Brugger  97.822031  91.562805  62.019763
166  166       Tawana Oberg  79.247553  97.281272  67.052822
167  167      Malisa Jeanes  40.686760  52.608267  94.679795
169  169        Tresa Sinha  52.226320  65.687011  86.804102
174  174      Dusti Lemmond  91.519681  50.376827  51.539391
182  182    Jenise Mcguffie  83.684382  73.799318  89.572009
184  184   Harriett Velarde  41.479883  95.694937  83.039160
185  185        Kam Senters  49.882254  45.295154  68.880490
188  188       Leola Lundin  60.314726  41.123275  74.869918
190  190       Adrien Renda  64.161092  66.937306  96.056034
191  191        Efrain Claw  94.671538  82.300879  75.860758
193  193     Mariela Sherer  47.671967  41.557435  70.461281

In [24]:
failed_students = students_dataframe.loc[(students_dataframe['exam'] <= 40) & (students_dataframe['quiz'] <= 40) & (students_dataframe['homework'] <= 40),['ID','name','exam','quiz','homework']]
failed_students

   ID        name     exam       quiz   homework
0   0  aimee Zank  1.46318  11.782733  35.874035

#### 4. Find the total and average of the exam, quiz and homework and store them in a separate collection

In [25]:
students_dataframe_2 =students_dataframe
students_dataframe_2['Average'] = students_dataframe_2['total']/3
students_dataframe_2

,ID,name,exam,quiz,homework,total,Average
0,0,aimee Zank,1.463180,11.782733,35.874035,49.119948,16.373316
1,1,Aurelia Menendez,60.060451,52.797907,71.761334,184.619692,61.539897
2,2,Corliss Zuk,67.030771,6.301852,66.283447,139.616069,46.538690
3,3,Bao Ziglar,71.643439,24.802213,42.261471,138.707123,46.235708
4,4,Zachary Langlais,78.683851,90.296310,34.416201,203.396363,67.798788
...,...,...,...,...,...,...,...
195,195,Linnie Weigel,52.445784,90.777505,11.750084,154.973373,51.657791
196,196,Santiago Dollins,52.040526,33.633001,78.792574,164.466100,54.822033
197,197,Tonisha Games,38.512696,31.162876,79.158564,148.834135,49.611378
198,198,Timothy Harrod,11.907567,20.518800,64.856504,97.282871,32.427624
199,199,Rae Kohout,82.117426,49.612955,28.868237,160.598617,53.532872

#### Warning data is already loaded in the database running  this cell again may cause Duplicate key Error

#### 5.Create a new collection which consists of students who scored below average and above 40% in all the categories.

In [ ]:
#creating a seperate collection in mongodb which has addition coloums like total and average
updated_students_data = students_dataframe_2.to_json('update1.json')

mycol_2 = mydb['updated_students_data']
loading_data = [mycol_2.insert_one(student) for student in students_data]
students_data

In [27]:
below_avg_but_passed = passed_students.loc[(passed_students['exam'] < average_mark ) & (passed_students['quiz'] < students_dataframe['quiz'].mean())& (passed_students['homework']<students_dataframe['homework'].mean()) ,
                    ['ID','name','exam','quiz','homework']]
below_avg_but_passed
#there is no one who scored above 40 but below average in all the 3 categories.

Empty DataFrame
Columns: [ID, name, exam, quiz, homework]
Index: []

#### 6.Create a new collection which consists of students who scored below the fail mark in all the categories.

In [28]:
failed_students_all_categories = failed_students.to_json('failed.json')
file = open('failed.json')
students_data = [json.loads(fail) for fail in file]
mycol_3 = mydb['Failed_students']
loading_data = [mycol_3.insert_one(student) for student in students_data]

In [80]:
students_data

[{'ID': {'0': 0},
  'name': {'0': 'aimee Zank'},
  'exam': {'0': 1.4631797367},
  'quiz': {'0': 11.7827330996},
  'homework': {'0': 35.8740349954},
  '_id': ObjectId('63613a0957cf3fc7d95c7418')}]

#### 7.Create a new collection which consists of students who scored above pass mark in all the categories

In [30]:
passed_students= passed_students.to_json('passed.json')
file = open('passed.json')
students_data = [json.loads(passed) for passed in file]
mycol_4 = mydb['passed_students']
loading_data = [mycol_4.insert_one(student) for student in students_data]